#
# 名称
#

########################################################################################################################
# 资源准备

###########
# 第三方库 #
##########
import json
import requests

############
# 自创建模块 #
###########

#########
# 变量池 #
########

########################################################################################################################
# 函数集

##############
# 发送私聊消息 #
#############
def send_private_msg(host, user_id, msg):
    try:
        r = json.loads(requests.post(f'{host}send_private_msg', data={
            'user_id': user_id,
            'message': msg,
        }).text)
    except Exception as e:
        return e
    else:
        return None