#
# aie版本升级程序
#

########################################################################################################################
# 资源准备

###########
# 第三方库 #
##########

############
# 自创建模块 #
###########
from update.update_core import *

#########
# 变量池 #
########
update_target = {
    '3.0.0': v300to31,
    '3.1': None
}

########################################################################################################################
# 升级程序 #
##########
def update(config):

    while True:
        # 匹配
        tmp = update_target[config['version']]
        # 如果没有更新则退出
        if not tmp:
            return config
        # 如果有则更新
        config = tmp(config)
        print(config)